Revit 2027 API
FabricationPart.SetStiffenerInfo Method
 Sets the stiffener information for the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetStiffenerInfo(
	int index,
	int stiffenerId,
	bool locked
)
Public Sub SetStiffenerInfo (
	index As Integer,
	stiffenerId As Integer,
	locked As Boolean
)
public:
void SetStiffenerInfo(
	int index,
	int stiffenerId,
	bool locked
)
member SetStiffenerInfo :
        index : int *
        stiffenerId : int *
        locked : bool -> unit
Parameters
index Int32
 The index of the stiffener to set.
stiffenerId Int32
 The identifier of the stiffener to set.
locked Boolean
 If true the stiffener will be locked and not changed by automatic processes.
Exceptions
Exception | Condition
ArgumentException |  The stiffener identifier is not valid.
ArgumentOutOfRangeException |  The stiffener index is out of range.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace